# Formas de Seleção

In [1]:
import pandas as pd

In [22]:
# Outra forma de criar lista: usando a função split()
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [23]:
# Criando um novo DataFrame e usando o split() para criar a lista
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (9, 10, 11, 12),
        (13, 14, 15, 16)]

df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [24]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [25]:
# Criando uma Series com o valor da coluna c1
df['c1']

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [26]:
type(df['c1'])

pandas.core.series.Series

In [27]:
# Criando um DataFrame selecionando mais de uma coluna, sem importar a ordem
df[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [28]:
type(df[['c3','c1']])

pandas.core.frame.DataFrame

In [29]:
# Selecionando todas as linhas
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [30]:
# Selecionando todas as linhas a partir da linha 1
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [31]:
# Selecionando somente as linhas 2 e 3 (lembrando que não é incluído o último índice)
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [32]:
# Selecionando apenas a linha 2
df[1:2]

    c1  c2  c3  c4
l2   5   6   7   8

In [33]:
# Outra forma de fazer a seleção a partir da linha 1 e especificando ainda mais o que queremos
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   9
l4  15  13

## Usando loc

__O que o loc faz?__
Permite que você faça seleções a partir dos rótulos das linhas (algo que não fizemos até agora, pois usamos só os índices numéricos)

In [35]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [34]:
# Criando uma Series apenas com os dados das colunas na linha selecionada
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [36]:
# Selecionando mais de uma linha
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   9  10  11  12
l2   5   6   7   8

In [37]:
# Selecionando um valor específico ao indicar sua linha e coluna
df.loc['l1', 'c2']

2

## Usando o iloc

__O que o iloc faz?__

Ao invés de usar os rótulos, ele usa os índices numéricos

In [38]:
# Outra forma de fazer, com o iloc
df.iloc[0, 1]

2

In [39]:
# Selecionando grupos de linhas e grupos de colunas usando loc
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   9
l1   4   1

In [41]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [40]:
# Fazendo a mesma coisa usando o iloc
df.iloc[[2, 0], [3, 0]]

    c4  c1
l3  12   9
l1   4   1

## Fim